nevinxu/HM502B2/platform/CMSIS/Include/device/MKL33Z4/MKL33Z4_sim.h
/*! @brief Set the PORTC field to a new value. */
#define BW_SIM_SCGC5_PORTC(x, v) (BME_BFI32(HW_SIM_SCGC5_ADDR(x), ((uint32_t)(v) << BP_SIM_SCGC5_PORTC), BP_SIM_SCGC5_PORTC, 1))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field PORTD[12] (RW)
 *
 * Controls the clock gate to the Port D module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
#define BP_SIM_SCGC5_PORTD   (12U)         /*!< Bit position for SIM_SCGC5_PORTD. */
#define BM_SIM_SCGC5_PORTD   (0x00001000U) /*!< Bit mask for SIM_SCGC5_PORTD. */
#define BS_SIM_SCGC5_PORTD   (1U)          /*!< Bit field size in bits for SIM_SCGC5_PORTD. */

/*! @brief Read current value of the SIM_SCGC5_PORTD field. */
#define BR_SIM_SCGC5_PORTD(x) (BME_UBFX32(HW_SIM_SCGC5_ADDR(x), BP_SIM_SCGC5_PORTD, BS_SIM_SCGC5_PORTD))

/*! @brief Format value for bitfield SIM_SCGC5_PORTD. */
#define BF_SIM_SCGC5_PORTD(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SCGC5_PORTD) & BM_SIM_SCGC5_PORTD)

/*! @brief Set the PORTD field to a new value. */
#define BW_SIM_SCGC5_PORTD(x, v) (BME_BFI32(HW_SIM_SCGC5_ADDR(x), ((uint32_t)(v) << BP_SIM_SCGC5_PORTD), BP_SIM_SCGC5_PORTD, 1))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field PORTE[13] (RW)
 *
 * Controls the clock gate to the Port E module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
#define BP_SIM_SCGC5_PORTE   (13U)         /*!< Bit position for SIM_SCGC5_PORTE. */
#define BM_SIM_SCGC5_PORTE   (0x00002000U) /*!< Bit mask for SIM_SCGC5_PORTE. */
#define BS_SIM_SCGC5_PORTE   (1U)          /*!< Bit field size in bits for SIM_SCGC5_PORTE. */

/*! @brief Read current value of the SIM_SCGC5_PORTE field. */
#define BR_SIM_SCGC5_PORTE(x) (BME_UBFX32(HW_SIM_SCGC5_ADDR(x), BP_SIM_SCGC5_PORTE, BS_SIM_SCGC5_PORTE))

/*! @brief Format value for bitfield SIM_SCGC5_PORTE. */
#define BF_SIM_SCGC5_PORTE(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SCGC5_PORTE) & BM_SIM_SCGC5_PORTE)

/*! @brief Set the PORTE field to a new value. */
#define BW_SIM_SCGC5_PORTE(x, v) (BME_BFI32(HW_SIM_SCGC5_ADDR(x), ((uint32_t)(v) << BP_SIM_SCGC5_PORTE), BP_SIM_SCGC5_PORTE, 1))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field SLCD[19] (RW)
 *
 * This bit controls the clock gate to the Segment LCD module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
#define BP_SIM_SCGC5_SLCD    (19U)         /*!< Bit position for SIM_SCGC5_SLCD. */
#define BM_SIM_SCGC5_SLCD    (0x00080000U) /*!< Bit mask for SIM_SCGC5_SLCD. */
#define BS_SIM_SCGC5_SLCD    (1U)          /*!< Bit field size in bits for SIM_SCGC5_SLCD. */

/*! @brief Read current value of the SIM_SCGC5_SLCD field. */
#define BR_SIM_SCGC5_SLCD(x) (BME_UBFX32(HW_SIM_SCGC5_ADDR(x), BP_SIM_SCGC5_SLCD, BS_SIM_SCGC5_SLCD))

/*! @brief Format value for bitfield SIM_SCGC5_SLCD. */
#define BF_SIM_SCGC5_SLCD(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SCGC5_SLCD) & BM_SIM_SCGC5_SLCD)

/*! @brief Set the SLCD field to a new value. */
#define BW_SIM_SCGC5_SLCD(x, v) (BME_BFI32(HW_SIM_SCGC5_ADDR(x), ((uint32_t)(v) << BP_SIM_SCGC5_SLCD), BP_SIM_SCGC5_SLCD, 1))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field LPUART0[20] (RW)
 *
 * This bit controls the clock gate to the LPUART0 module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
#define BP_SIM_SCGC5_LPUART0 (20U)         /*!< Bit position for SIM_SCGC5_LPUART0. */
#define BM_SIM_SCGC5_LPUART0 (0x00100000U) /*!< Bit mask for SIM_SCGC5_LPUART0. */
#define BS_SIM_SCGC5_LPUART0 (1U)          /*!< Bit field size in bits for SIM_SCGC5_LPUART0. */

/*! @brief Read current value of the SIM_SCGC5_LPUART0 field. */
#define BR_SIM_SCGC5_LPUART0(x) (BME_UBFX32(HW_SIM_SCGC5_ADDR(x), BP_SIM_SCGC5_LPUART0, BS_SIM_SCGC5_LPUART0))

/*! @brief Format value for bitfield SIM_SCGC5_LPUART0. */
#define BF_SIM_SCGC5_LPUART0(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SCGC5_LPUART0) & BM_SIM_SCGC5_LPUART0)

/*! @brief Set the LPUART0 field to a new value. */
#define BW_SIM_SCGC5_LPUART0(x, v) (BME_BFI32(HW_SIM_SCGC5_ADDR(x), ((uint32_t)(v) << BP_SIM_SCGC5_LPUART0), BP_SIM_SCGC5_LPUART0, 1))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field LPUART1[21] (RW)
 *
 * This bit controls the clock gate to the LPUART1 module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
#define BP_SIM_SCGC5_LPUART1 (21U)         /*!< Bit position for SIM_SCGC5_LPUART1. */
#define BM_SIM_SCGC5_LPUART1 (0x00200000U) /*!< Bit mask for SIM_SCGC5_LPUART1. */
#define BS_SIM_SCGC5_LPUART1 (1U)          /*!< Bit field size in bits for SIM_SCGC5_LPUART1. */

/*! @brief Read current value of the SIM_SCGC5_LPUART1 field. */
#define BR_SIM_SCGC5_LPUART1(x) (BME_UBFX32(HW_SIM_SCGC5_ADDR(x), BP_SIM_SCGC5_LPUART1, BS_SIM_SCGC5_LPUART1))

/*! @brief Format value for bitfield SIM_SCGC5_LPUART1. */
#define BF_SIM_SCGC5_LPUART1(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SCGC5_LPUART1) & BM_SIM_SCGC5_LPUART1)

/*! @brief Set the LPUART1 field to a new value. */
#define BW_SIM_SCGC5_LPUART1(x, v) (BME_BFI32(HW_SIM_SCGC5_ADDR(x), ((uint32_t)(v) << BP_SIM_SCGC5_LPUART1), BP_SIM_SCGC5_LPUART1, 1))
/*@}*/

/*!
 * @name Register SIM_SCGC5, field FLEXIO[31] (RW)
 *
 * This bit controls the clock gate to the FlexIO Module.
 *
 * Values:
 * - 0 - Clock disabled
 * - 1 - Clock enabled
 */
/*@{*/
#define BP_SIM_SCGC5_FLEXIO  (31U)         /*!< Bit position for SIM_SCGC5_FLEXIO. */
#define BM_SIM_SCGC5_FLEXIO  (0x80000000U) /*!< Bit mask for SIM_SCGC5_FLEXIO. */
#define BS_SIM_SCGC5_FLEXIO  (1U)          /*!< Bit field size in bits for SIM_SCGC5_FLEXIO. */

/*! @brief Read current value of the SIM_SCGC5_FLEXIO field. */
#define BR_SIM_SCGC5_FLEXIO(x) (BME_UBFX32(HW_SIM_SCGC5_ADDR(x), BP_SIM_SCGC5_FLEXIO, BS_SIM_SCGC5_FLEXIO))

/*! @brief Format value for bitfield SIM_SCGC5_FLEXIO. */
#define BF_SIM_SCGC5_FLEXIO(v) ((uint32_t)((uint32_t)(v) << BP_SIM_SCGC5_FLEXIO) & BM_SIM_SCGC5_FLEXIO)

/*! @brief Set the FLEXIO field to a new value. */
#define BW_SIM_SCGC5_FLEXIO(x, v) (BME_BFI32(HW_SIM_SCGC5_ADDR(x), ((uint32_t)(v) << BP_SIM_SCGC5_FLEXIO), BP_SIM_SCGC5_FLEXIO, 1))
/*@}*/

